flowchart.dot
digraph "flowchart" {
rankdir=TB;
v0 [shape=point,label="",fixedsize=true,width=0.1,xlabel="Channel.fromPath"];
v1 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="splitCsv"];
v0 -> v1;

v1 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="splitCsv"];
v2 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="map"];
v1 -> v2;

v2 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="map"];
v3 [label="FASTQC"];
v2 -> v3 [label="read_ch"];

v3 [label="FASTQC"];
v6 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="mix"];
v3 -> v6;

v3 [label="FASTQC"];
v6 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="mix"];
v3 -> v6;

v2 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="map"];
v4 [label="TRIM_GALORE"];
v2 -> v4 [label="read_ch"];

v4 [label="TRIM_GALORE"];
v5 [shape=point];
v4 -> v5;

v4 [label="TRIM_GALORE"];
v6 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="mix"];
v4 -> v6;

v4 [label="TRIM_GALORE"];
v6 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="mix"];
v4 -> v6;

v4 [label="TRIM_GALORE"];
v6 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="mix"];
v4 -> v6;

v6 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="mix"];
v7 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v6 -> v7;

v7 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v9 [label="MULTIQC"];
v7 -> v9;

v8 [shape=point,label="",fixedsize=true,width=0.1];
v9 [label="MULTIQC"];
v8 -> v9 [label="output_name"];

v9 [label="MULTIQC"];
v11 [shape=point];
v9 -> v11;

v9 [label="MULTIQC"];
v10 [shape=point];
v9 -> v10;

}
