flowchart.mmd
flowchart TB
    subgraph " "
    v0["Channel.fromPath"]
    v8["output_name"]
    end
    v3(["FASTQC"])
    v4(["TRIM_GALORE"])
    subgraph " "
    v5[" "]
    v10[" "]
    v11[" "]
    end
    v9(["MULTIQC"])
    v1(( ))
    v6(( ))
    v0 --> v1
    v1 --> v3
    v3 --> v6
    v1 --> v4
    v4 --> v5
    v4 --> v6
    v8 --> v9
    v6 --> v9
    v9 --> v11
    v9 --> v10
